zhouyuming/qemu-5.0.0/hw/char/stm32f1xx_usart.c
/*
 * Copyright (c) 2025 liang yan <yanl1229@163.com>
 *
 * STM32F1XX USART Controller
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 *
 * Contributions after 2012-01-13 are licensed under the terms of the
 * GNU GPL, version 2 or (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "hw/char/stm32f1xx_usart.h"
#include "qemu/log.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "qemu/module.h"
#include "migration/vmstate.h"

#ifndef STM_USART_DEBUG
#define STM_USART_DEBUG 0
#endif

#define DB_PRINT_L(lvl, fmt, args...) do { \
    if (STM_USART_DEBUG >= lvl) { \
        qemu_log("%s: " fmt, __func__, ## args); \
    } \
} while (0);

#define DB_PRINT(fmt, args...) DB_PRINT_L(1, fmt, ## args)

static int stm32f1xx_usart_can_receive(void *opaque)
{
    STM32F1XXUsartState *s = opaque;

    if (!(s->usart_sr & USART_SR_RXNE)) {
        return 1;
    }

    return 0;
}

static void stm32f1xx_usart_receive(void *opaque, const uint8_t *buf, int size)
{
    STM32F1XXUsartState *s = opaque;

    s->usart_dr = *buf;

    if (!(s->usart_cr1 & USART_CR1_UE && s->usart_cr1 & USART_CR1_RE)) {
        /* USART not enabled - drop the chars */
        DB_PRINT("Dropping the chars\n");
        return;
    }

    s->usart_sr |= USART_SR_RXNE;

    if (s->usart_cr1 & USART_CR1_RXNEIE) {
        qemu_set_irq(s->irq, 1);
    }

    DB_PRINT("Receiving: %c\n", s->usart_dr);
}

static void stm32f1xx_usart_reset(DeviceState *dev)
{
    STM32F1XXUsartState *s = STM32F1XX_USART(dev);

    s->usart_sr = USART_SR_RESET;
    s->usart_dr = 0x00000000;
    s->usart_brr = 0x00000000;
    s->usart_cr1 = 0x00000000;
    s->usart_cr2 = 0x00000000;
    s->usart_cr3 = 0x00000000;
    s->usart_gtpr = 0x00000000;

    qemu_set_irq(s->irq, 0);
}

static uint64_t stm32f1xx_usart_read(void *opaque, hwaddr addr,
                                       unsigned int size)
{
    STM32F1XXUsartState *s = opaque;
    uint64_t retvalue;

    DB_PRINT("Read 0x%"HWADDR_PRIx"\n", addr);

    switch (addr) {
    case USART_SR:
        retvalue = s->usart_sr;
        qemu_chr_fe_accept_input(&s->chr);
        return retvalue;
    case USART_DR:
        DB_PRINT("Value: 0x%" PRIx32 ", %c\n", s->usart_dr, (char) s->usart_dr);
        s->usart_sr |= USART_SR_TXE;
        s->usart_sr &= ~USART_SR_RXNE;
        qemu_chr_fe_accept_input(&s->chr);
        qemu_set_irq(s->irq, 0);
        if (s->usart_cr1 & USART_CR1_M)
            return s->usart_dr & 0x1FF;
        else
            return s->usart_dr & 0xFF;
    case USART_BRR:
        return s->usart_brr;
    case USART_CR1:
        return s->usart_cr1;
    case USART_CR2:
        return s->usart_cr2;
    case USART_CR3:
        return s->usart_cr3;
    case USART_GTPR:
        return s->usart_gtpr;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: Bad offset 0x%"HWADDR_PRIx"\n", __func__, addr);
        return 0;
    }

    return 0;
}

static void stm32f1xx_usart_write(void *opaque, hwaddr addr,
                                  uint64_t val64, unsigned int size)
{
    STM32F1XXUsartState *s = opaque;
    uint32_t value = val64;
    unsigned char ch;

    DB_PRINT("Write 0x%" PRIx32 ", 0x%"HWADDR_PRIx"\n", value, addr);

    switch (addr) {
    case USART_SR:
        s->usart_sr &= value;
        return;
    case USART_DR:
        if (s->usart_cr1 & USART_CR1_M)
            ch = value & 0x1FF;
        else
            ch = value & 0xFF;
        if (!(s->usart_cr1 & USART_CR1_TE))
            return;
        if ((s->usart_sr &USART_SR_TC))
            s->usart_sr &= ~USART_SR_TC;
        ch = value;
        qemu_chr_fe_write_all(&s->chr, &ch, 1);
        s->usart_sr |= USART_SR_TXE;
        if (s->usart_cr1 & USART_CR1_TXEIE)
            qemu_set_irq(s->irq, 0);
        s->usart_sr |= USART_SR_TC;
        if (s->usart_cr1 & USART_CR1_TCIE)
            qemu_set_irq(s->irq, 0);
        break;
    case USART_BRR:
        s->usart_brr |= value & 0xFFFF;
        break;
    case USART_CR1:
        if (!(s->usart_cr1 & USART_CR1_TE) && (value & USART_CR1_TE))
            s->usart_dr = 0xFF;
        s->usart_cr1 |= value & 0xFFFF;
        if (s->usart_cr1 & USART_CR1_RXNEIE &&
            s->usart_sr & USART_SR_RXNE) {
            qemu_set_irq(s->irq, 0);
        }
        break;
    case USART_CR2:
        s->usart_cr2 |= value & 0xFFFF;
        break;
    case USART_CR3:
        s->usart_cr3 |= value;
        break;
    case USART_GTPR:
        s->usart_gtpr |= value & 0xFFFF;
        break;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: Bad offset 0x%"HWADDR_PRIx"\n", __func__, addr);
        break;
    }
}

static const MemoryRegionOps stm32f1xx_usart_ops = {
    .read = stm32f1xx_usart_read,
    .write = stm32f1xx_usart_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

static const VMStateDescription vmstate_stm32f1xx_usart = {
    .name = TYPE_STM32F1XX_USART,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (VMStateField[]) {
        VMSTATE_UINT32(usart_sr, STM32F1XXUsartState),
        VMSTATE_UINT32(usart_dr, STM32F1XXUsartState),
        VMSTATE_UINT32(usart_brr, STM32F1XXUsartState),
        VMSTATE_UINT32(usart_cr1, STM32F1XXUsartState),
        VMSTATE_UINT32(usart_cr2, STM32F1XXUsartState),
        VMSTATE_UINT32(usart_cr3, STM32F1XXUsartState),
        VMSTATE_UINT32(usart_gtpr, STM32F1XXUsartState),
        VMSTATE_END_OF_LIST()
    }
};

static Property stm32f1xx_usart_properties[] = {
    DEFINE_PROP_CHR("chardev", STM32F1XXUsartState, chr),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32f1xx_usart_init(Object *obj)
{
    STM32F1XXUsartState *s = STM32F1XX_USART(obj);

    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    memory_region_init_io(&s->mmio, obj, &stm32f1xx_usart_ops, s,
                          TYPE_STM32F1XX_USART, 0x400);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->mmio);
}

static void stm32f1xx_usart_realize(DeviceState *dev, Error **errp)
{
    STM32F1XXUsartState *s = STM32F1XX_USART(dev);

     qemu_chr_fe_set_handlers(&s->chr, stm32f1xx_usart_can_receive,
                             stm32f1xx_usart_receive, NULL, NULL,
                             s, NULL, true);
}

static void stm32f1xx_usart_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset   = stm32f1xx_usart_reset;
    dc->props   = stm32f1xx_usart_properties;
    set_bit(DEVICE_CATEGORY_INPUT, dc->categories);
    dc->realize = stm32f1xx_usart_realize;
    dc->vmsd    = &vmstate_stm32f1xx_usart;
}

static const TypeInfo stm32f1xx_usart_info = {
    .name          = TYPE_STM32F1XX_USART,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32F1XXUsartState),
    .instance_init = stm32f1xx_usart_init,
    .class_init    = stm32f1xx_usart_class_init,
};

static void stm32f1xx_usart_register_types(void)
{
    type_register_static(&stm32f1xx_usart_info);
}

type_init(stm32f1xx_usart_register_types)
